base/Catalogs/бит_ПользовательскиеФункции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеФункции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодпрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВозвращаемогоЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КонтекстыВыполненияПользовательскихФункций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Comment>Версия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОбязательныйДляЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
					<Comment>Переменные</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonForms/бит_ФормаКонструктораЗначений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПараметрыОткрытияФормы();
	
	СоздатьХранилищеТиповДанных();
	
	ЗаполнитьДеревоПредопределенными();
	ЗаполнитьДеревоПоТекущемуШаблону();
	
	ДоступныеТипы = ПолучитьИзВременногоХранилища(ДоступныеТипыАдрес);
	
	// Ограничим тип поля ввода фиксированного значения.
	Если ДоступныеТипы <> Неопределено Тогда
		Элементы.ПолеФиксированноеЗначение.ОграничениеТипа = ДоступныеТипы;
		ПолеФиксированноеЗначение = ДоступныеТипы.ПривестиЗначение();		
		Если ТипЗнч(ТекущееЗначение) = Тип("СписокЗначений") ИЛИ ВидСравнения = Перечисления.бит_ЛогическиеОператоры.ВСписке Тогда
		
			 Элементы.ПолеФиксированноеЗначение.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
			 Если ПолеФиксированноеЗначение = Неопределено Тогда			 
			 	  ПолеФиксированноеЗначение = Новый СписокЗначений;			 
			 КонецЕсли; 
		
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Теперь необходимо позиционировать выделение на строку, соответствующую текущему значению.
	ПозиционироватьВыделение();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимПостроителяПроизвольногоВыраженияПриИзменении(Элемент)
	
	ДеревоЗначенийПриАктивизацииСтроки(Элементы.ДеревоЗначений);
	
	Если РежимПостроителяПроизвольногоВыражения Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРеквизит;
		Элементы.НадписьСтрокаЗначения.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗначений

&НаКлиенте
Процедура ДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если РежимПостроителяПроизвольногоВыражения Тогда
		ПриВыбореЗначенияРежимПостроителя();
	Иначе	
		ПриВыбореЗначения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПриАктивизацииСтроки(Элемент)
	
	ДанныеСтроки = Элементы.ДеревоЗначений.ТекущиеДанные;
		
	Если НЕ РежимПостроителяПроизвольногоВыражения Тогда
		
		НадписьСтрокаЗначения = ПолучитьПолноеИмяРеквизита(ДанныеСтроки);
		НадписьНеИспользуется = Ложь;
		
		Если ДанныеСтроки.Тип = "ПользовательскаяФункция" Тогда
			
			ИмяФункции = ПолучитьПолноеИмяРеквизита(ДанныеСтроки);			
			ПодчиненныеСтроки = ДанныеСтроки.ПолучитьЭлементы();
			
			// Дополним строку параметрами.
			ИмяФункции = ИмяФункции + "(";		
			Для Каждого Параметр Из ПодчиненныеСтроки Цикл
				ИмяФункции = ИмяФункции + ", " + Строка(Параметр.Значение);
			КонецЦикла;
			ИмяФункции = ИмяФункции + ")";			
			ИмяФункции = СтрЗаменить(ИмяФункции, "(,", "(");
			
			НадписьСтрокаЗначения = ИмяФункции;
			
		КонецЕсли;
		
		Если НЕ ДанныеСтроки.Использование Тогда
			НадписьСтрокаЗначения = НСтр("ru = '<не используется для данного реквизита>'; 
										 |en = '<не используется для данного реквизита>'");
			НадписьНеИспользуется = Истина;
		КонецЕсли;
		
		Элементы.НадписьСтрокаЗначения.ТолькоПросмотр = НЕ ДанныеСтроки.Использование;
		
		Если ДанныеСтроки.Тип = "ФиксированноеЗначение" Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаФиксированноеЗначение;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРеквизит;
		КонецЕсли;
		
	Иначе
		
		Если НадписьНеИспользуется Тогда
			НадписьСтрокаЗначения = "";
			НадписьНеИспользуется = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается в тот момент, когда пользователь выбирает значение и возвращает
// выбранное значение реквизиту-владельцу формы.
// 
&НаКлиенте
Процедура ПриВыбореЗначения()
	
	// Проверим, какие данные содержатся в текущей строке и можно ли их выбирать.
	ТекущаяСтрока = Элементы.ДеревоЗначений.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (ТекущаяСтрока.Тип = "Реквизит" 
		  ИЛИ ТекущаяСтрока.Тип = "ДопРеквизит" 
		  ИЛИ ТекущаяСтрока.Тип = "ДопАналитика") 
		  И ТекущаяСтрока.Использование Тогда
		
		Структура = Новый Структура("Значение, ПодчиненноеЗначение");
		Структура.Значение = ПолучитьПолноеИмяРеквизита(ТекущаяСтрока);
		
		ОгрТип = ПолучитьОписаниеИзХранилища(ТекущаяСтрока.ПолучитьИдентификатор());		
		Если ОгрТип = Тип("ОписаниеТипов") Тогда
			Структура.ПодчиненноеЗначение = ОгрТип.ПривестиЗначение();
		КонецЕсли;
		
		Закрыть(Структура);
		
	КонецЕсли;
	
	Если ТекущаяСтрока.Тип = "ФиксированноеЗначение" Тогда		
		Если ТипЗнч(ПолеФиксированноеЗначение) = Тип("Строка") И Найти(ПолеФиксированноеЗначение, "#") = 0 Тогда
			Закрыть("""" + ПолеФиксированноеЗначение + """");
		Иначе	
			Закрыть(ПолеФиксированноеЗначение);
		КонецЕсли;				
	КонецЕсли;
	
	Если ТекущаяСтрока.Тип = "ПроизвольнаяСтрока" Тогда
		Закрыть("");
	КонецЕсли;
	
	Если ТекущаяСтрока.Тип = "ПользовательскаяФункция" Тогда
		
		ИмяФункции = ПолучитьПолноеИмяРеквизита(ТекущаяСтрока);
		
		// Дополним строку параметрами.
		ИмяФункции = ИмяФункции + "(";
		
		ТекСтроки = ТекущаяСтрока.ПолучитьЭлементы();		
		Для Каждого Параметр Из ТекСтроки Цикл
			ИмяФункции = ИмяФункции + ", " + Строка(Параметр.Значение);
		КонецЦикла;
		
		ИмяФункции = ИмяФункции + ")";		
		ИмяФункции = СтрЗаменить(ИмяФункции, "(,", "(");
		
		Закрыть(ИмяФункции);
		
	КонецЕсли;
		
	Если ТекущаяСтрока.Тип = "ПараметрПользовательскойФункции" Тогда
		
		ПараметрыФормыКонструктора 	= Новый Структура("Документ, ВидПроформы, МассивИменРеквизитов, ДоступныеТипы, ТекущееЗначение, ТабличнаяЧасть, НеПоказыватьПользовательскиеФункции");
		ДоступныеТипы 				= ПолучитьОписаниеИзХранилища(ТекущаяСтрока.ПолучитьИдентификатор());
		
		ПараметрыФормыКонструктора.МассивИменРеквизитов 	= МассивИменРеквизитов;
		ПараметрыФормыКонструктора.ДоступныеТипы 			= ДоступныеТипы;
		ПараметрыФормыКонструктора.ТекущееЗначение 			= ТекущаяСтрока.Значение;
		ПараметрыФормыКонструктора.ТабличнаяЧасть			= ТабличнаяЧасть;
		ПараметрыФормыКонструктора.Документ					= Документ;
		ПараметрыФормыКонструктора.ВидПроформы				= ВидПроформы;
		
		ПараметрыФормыКонструктора.НеПоказыватьПользовательскиеФункции	= Ложь;
		
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("ТекущаяСтрокаКонструктора", ТекущаяСтрока);
		Обработчик = Новый ОписаниеОповещения("ОбработкаВыбораПараметраПользовательскойФункции", ЭтотОбъект, ПараметрыВыполнения);
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("ОбщаяФорма.бит_ФормаКонструктораЗначений", ПараметрыФормыКонструктора, , , , , Обработчик, РежимОткрытия);		
				
	КонецЕсли;
	
КонецПроцедуры

// Выполняет заполнение выбранных значений в строках-источниках вызова.
// См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОбработкаВыбораПараметраПользовательскойФункции(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ВходящийКонтекст.ТекущаяСтрокаКонструктора;
	ТекущаяСтрока.Значение = ?(ТипЗнч(Результат) = Тип("Структура"), Результат.Значение, Результат);
	ТекущаяСтрока.Синоним  = ТекущаяСтрока.СинонимФикс + " : <" + Строка(ТекущаяСтрока.Значение) + ">";
	
КонецПроцедуры

// Процедура вызывается в тот момент, когда пользователь выбирает значение и возвращает
// выбранное значение реквизиту-владельцу формы.
// 
&НаКлиенте
Процедура ПриВыбореЗначенияРежимПостроителя()
	
	// Проверим, какие данные содержатся в текущей строке и можно ли их выбирать.
	ДанныеСтроки = Элементы.ДеревоЗначений.ТекущиеДанные;	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НадписьНеИспользуется Тогда
		НадписьСтрокаЗначения = "";
		НадписьНеИспользуется = Ложь;
	КонецЕсли;
	
	НадписьСтрокаЗначения_ = ПолучитьПолноеИмяРеквизита(ДанныеСтроки);
	
	Если ДанныеСтроки.Тип = "ПользовательскаяФункция" Тогда
		
		ИмяФункции = ПолучитьПолноеИмяРеквизита(ДанныеСтроки);
		
		ПодчиненныеСтроки = ДанныеСтроки.ПолучитьЭлементы();
		
		// Дополним строку параметрами.
		ИмяФункции = ИмяФункции + "(";		
		Для Каждого Параметр Из ПодчиненныеСтроки Цикл
			ИмяФункции = ИмяФункции + ", " + Строка(Параметр.Значение);
		КонецЦикла;
		ИмяФункции = ИмяФункции + ")";
		
		ИмяФункции = СтрЗаменить(ИмяФункции, "(,", "(");
		
		НадписьСтрокаЗначения_ = ИмяФункции;
		
	КонецЕсли;
	
	Элементы.НадписьСтрокаЗначения.ВыделенныйТекст = НадписьСтрокаЗначения_ + " ";
		
	Поз = СтрДлина(НадписьСтрокаЗначения + " ");
	
	Элементы.НадписьСтрокаЗначения.УстановитьГраницыВыделения(Поз - 1, Поз - 1);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИнфоОРежиме(Команда)
	
	ТекстВопроса = НСтр("ru='Выбранное значение будет добавлено в поле ""Результат"". Можно использовать арифметические операции (+,-,/,*)'; 
						|en='Выбранное значение будет добавлено в поле ""Результат"". Можно использовать арифметические операции (+,-,/,*)'");
	ПоказатьВопрос(, ТекстВопроса, РежимДиалогаВопрос.ОК)
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если РежимПостроителяПроизвольногоВыражения Тогда
		Закрыть(НадписьСтрокаЗначения);
	Иначе	
		ПриВыбореЗначения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(ТекущееЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииОбщегоНазначения

// Создает временное хранилище типов данных для последующей
// обработки на сервере.
// 
&НаСервере
Процедура СоздатьХранилищеТиповДанных()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ИдСтроки");
	ТаблицаЗначений.Колонки.Добавить("ОграничениеТипа");
	
	ХранилищеТиповДанныхАдрес = ПоместитьВоВременноеХранилище(ТаблицаЗначений, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

// Помещает во временное хранилище очередное описание типов данных
// для новой строки дерева.
// 
&НаСервере
Процедура ПоместитьОписаниеТипаВХранилище(ИДСтроки, ОписаниеТипа)
	
	ТЗ = ПолучитьИзВременногоХранилища(ХранилищеТиповДанныхАдрес);
	
	НовСтр 					= ТЗ.Добавить();
	НовСтр.ИДСтроки 		= ИДСтроки;
	НовСтр.ОграничениеТипа 	= ОписаниеТипа;
	
	ХранилищеТиповДанныхАдрес = ПоместитьВоВременноеХранилище(ТЗ, ХранилищеТиповДанныхАдрес);
	
КонецПроцедуры

// Получает из временного хранилище ограничение типа для строки
// с идентификатором "ИДСтроки".
// 
&НаСервере
Функция ПолучитьОписаниеИзХранилища(Знач ИДСтроки)
	
	ТЗ = ПолучитьИзВременногоХранилища(ХранилищеТиповДанныхАдрес);
	
	ИскСтр = ТЗ.Найти(ИДСтроки, "ИдСтроки");
	
	Если ИскСтр = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИскСтр.ОграничениеТипа;
	
КонецФункции

// Обрабатывает параметры открытия формы и помещает их значения в значения
// реквизитов формы.
// 
&НаСервере
Процедура ОбработатьПараметрыОткрытияФормы()
	
	Если Параметры.Свойство("ДоступныеТипы") Тогда
		// Поместим во временное хранилище доступные типы.
		ДоступныеТипыАдрес = ПоместитьВоВременноеХранилище(Параметры.ДоступныеТипы, ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
	Если Параметры.Свойство("ТабличнаяЧасть") Тогда
		ТабличнаяЧасть = Параметры.ТабличнаяЧасть;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущееЗначение") Тогда
		ТекущееЗначение = Параметры.ТекущееЗначение;
	КонецЕсли;
	
	Если Параметры.Свойство("ОписаниеТаблиц") Тогда
		ОписаниеТаблиц = Параметры.ОписаниеТаблиц;
	КонецЕсли;
	
	Параметры.Свойство("ВидСравнения", ВидСравнения);
		
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ;
	КонецЕсли;
	
	Если Параметры.Свойство("МассивИменРеквизитов") Тогда
		
		Если ТипЗнч(Параметры.МассивИменРеквизитов) = Тип("СписокЗначений") Тогда
			МассивИменРеквизитов.ЗагрузитьЗначения(Параметры.МассивИменРеквизитов.ВыгрузитьЗначения())
		Иначе	
			МассивИменРеквизитов.ЗагрузитьЗначения(Параметры.МассивИменРеквизитов.Выгрузить().ВыгрузитьКолонку("ИмяРеквизита"));
		КонецЕсли;
	
	КонецЕсли;
	
	Если Параметры.Свойство("ВидПроформы") Тогда
		ВидПроформы = Параметры.ВидПроформы;
	КонецЕсли;
	
	Параметры.Свойство("Регистр", Регистр);
	
	Если Параметры.Свойство("НеПоказыватьПользовательскиеФункции") Тогда
		НеПоказыватьПользовательскиеФункции = Параметры.НеПоказыватьПользовательскиеФункции;
	Иначе
		НеПоказыватьПользовательскиеФункции = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("РежимПостроителя") Тогда		
		РежимПостроителяПроизвольногоВыражения = Параметры.РежимПостроителя;		
		Если РежимПостроителяПроизвольногоВыражения Тогда
			НадписьСтрокаЗначения = ТекущееЗначение;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Определяет, содержится ли тип "РеквизитОписаниеТипа".Типы() в описании 
// типов в реквизите формы "ДоступныеТипы".
//
&НаСервере
Функция РеквизитПрошелПоТипу(РеквизитОписаниеТипа)
	
	ДоступныеТипы = ПолучитьИзВременногоХранилища(ДоступныеТипыАдрес);
	
	// Получим массив типов реквизита.
	Типы = РеквизитОписаниеТипа.Типы();
	
	Если ДоступныеТипы = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
			
	Для Каждого ТипРеквизита Из Типы Цикл
		Если ДоступныеТипы.СодержитТип(ТипРеквизита) Тогда
			// Если хотя бы один тип принадлежит массиву доступных - пропустим.
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Получает ветку дерева по имени. Рекомендуется для получения веток верхнего уровня.
//
&НаСервере
Функция ПолучитьВеткуДерева(ИмяСтроки)
	
	Отбор = Новый Структура("ИмяСтроки", ИмяСтроки);
	
	МассивИД = ИменаСтрокДерева.НайтиСтроки(Отбор);	
	Если МассивИД.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИДСтроки = МассивИД[0].ИД;
	
	Возврат ДеревоЗначений.НайтиПоИдентификатору(ИДСтроки);
	
	Возврат Неопределено;
	     
КонецФункции

// Получает ветку дерева по имени. Рекомендуется для получения веток верхнего уровня.
// 
&НаКлиенте
Функция ПолучитьВеткуДереваНаКлиенте(ИмяСтроки)
	
	Отбор = Новый Структура("ИмяСтроки", ИмяСтроки);
	
	МассивИД = ИменаСтрокДерева.НайтиСтроки(Отбор);	
	Если МассивИД.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИДСтроки = МассивИД[0].ИД;
	
	Возврат ДеревоЗначений.НайтиПоИдентификатору(ИДСтроки);
	
	Возврат Неопределено;
	     
КонецФункции

// Возвращает теговое представление выбранного реквизита.
// 
&НаКлиенте
Функция ПолучитьПолноеИмяРеквизита(Строка, ИмяИтог = "")
	
	Если Строка.Префикс = "" Тогда                  
		ИмяИтог = ПолучитьПолноеИмяРеквизита(Строка.ПолучитьРодителя(), Строка.ИмяРеквизита + ?(СокрЛП(ИмяИтог) = "", "", ".") + ИмяИтог);
	КонецЕсли;
	
	Если Строка.Префикс <> "" Тогда
		ИмяИтог = Строка.Префикс + "." + ИмяИтог;
	КонецЕсли;
	
	Возврат ИмяИтог;
	
КонецФункции

// Разбирает теговое представление значения реквизита "СтрокаИмен" и возвращает
// массив имен строк. Сверху-вниз по старшинству.
// 
&НаКлиенте
Функция ИменаСтрок(СтрокаИмен_)
	
	СтрокаИмен = СтрокаИмен_;
	
	МассивИмен = Новый Массив;
	
	Пока СтрДлина(СтрокаИмен) <> 0 Цикл
		
		// Получим текст до точки.
		ПозТочки = Найти(СтрокаИмен, ".");
		
		Если ПозТочки = 0 Тогда // Это последнее имя.
			МассивИмен.Добавить(СтрокаИмен);
			СтрокаИмен = "";
		Иначе
			
			ОчередноеИмя = Лев(СтрокаИмен, ПозТочки - 1);
			
			Если Найти(ОчередноеИмя, "#") > 0 Тогда // Имя тега
				
				Если ОчередноеИмя = "#Р" Тогда
					ОчередноеИмя = "Реквизиты";	
				ИначеЕсли ОчередноеИмя = "#П" Тогда
					ОчередноеИмя = "ПользовательскиеФункции";
				ИначеЕсли ОчередноеИмя = "#Ф" Тогда
					ОчередноеИмя = "ПрочиеФункции";
				ИначеЕсли ОчередноеИмя = "#Д" Тогда
					ОчередноеИмя = "ДопРеквизиты";
				ИначеЕсли ОчередноеИмя = "#А" Тогда
					ОчередноеИмя = "ДопАналитика";	
				ИначеЕсли ОчередноеИмя = "#Т" Тогда
					МассивИмен.Добавить("Реквизиты");
					ОчередноеИмя = ТабличнаяЧасть;
				КонецЕсли;
				
				МассивИмен.Добавить(ОчередноеИмя);
				
				Если ОчередноеИмя = "ПользовательскиеФункции" ИЛИ ОчередноеИмя = "ПрочиеФункции" Тогда
					// Сократим строку имен.
					СтрокаИмен = Прав(СтрокаИмен, СтрДлина(СтрокаИмен) - ПозТочки);
					// Получим имя самой функции: оно до скобок. Если нет скобок - не позиционируем.
					Скобка = Найти(СтрокаИмен, "(");
					Если Скобка = 0 Тогда
						
					Иначе
						ОчередноеИмя = Лев(СтрокаИмен, Скобка - 1);
						МассивИмен.Добавить(ОчередноеИмя);
					КонецЕсли;
					Возврат МассивИмен;
				КонецЕсли;
				
			Иначе
				МассивИмен.Добавить(ОчередноеИмя);
			КонецЕсли;
			
			// Сократим строку имен.
			СтрокаИмен = Прав(СтрокаИмен, СтрДлина(СтрокаИмен) - ПозТочки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивИмен;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Заполняет дерево значений предопределенными строками (строками верхнего уровня).
// 
&НаСервере
Процедура ЗаполнитьДеревоПредопределенными()
	
	СтрокиДЗ = ДеревоЗначений.ПолучитьЭлементы();
	
	ТекстСиноним = НСтр("ru='Реквизиты документа';en='Реквизиты документа'");
	ДобавитьВеткуДерева(СтрокиДЗ, "Реквизиты", ТекстСиноним, "Реквизиты", "#Р", Ложь);
	
	ТекстСиноним = НСтр("ru='Доп. реквизиты';en='Доп. реквизиты'");
	ДобавитьВеткуДерева(СтрокиДЗ, "ДопРеквизиты", ТекстСиноним, "ДопРеквизиты", "#Д", Ложь);
	
	ТекстСиноним = НСтр("ru='Доп. аналитика';en='Доп. аналитика'");
	ДобавитьВеткуДерева(СтрокиДЗ, "ДопАналитика", ТекстСиноним, "ДопАналитика", "#А", Ложь);
	
	ТекстСиноним = НСтр("ru='Произвольные таблицы';en='Произвольные таблицы'");
	ДобавитьВеткуДерева(СтрокиДЗ, "ПроизвольныеТаблицы", ТекстСиноним, "ПроизвольныеТаблицы", "#Т", Ложь);
	
	Если НЕ НеПоказыватьПользовательскиеФункции Тогда
		ТекстСиноним = НСтр("ru='Пользовательские функции';en='Пользовательские функции'");
		ДобавитьВеткуДерева(СтрокиДЗ, "Функции", ТекстСиноним, "ПользовательскиеФункции", "#П", Ложь);
	КонецЕсли;
	
	Если ДобавитьВеткуПрочиеФункции(Регистр.ИмяРегистра) Тогда
		ТекстСиноним = НСтр("ru='Прочие функции';en='Прочие функции'");
		ДобавитьВеткуДерева(СтрокиДЗ, "ПрочиеФункции", ТекстСиноним, "ПрочиеФункции", "#Ф", Ложь);		
	КонецЕсли; 
	
	ТекстСиноним = НСтр("ru='Фиксированное значение';en='Фиксированное значение'");
	ДобавитьВеткуДерева(СтрокиДЗ, "ФиксированноеЗначение", ТекстСиноним, "ФиксированноеЗначение", "-", Ложь);
	
	ТекстСиноним = НСтр("ru='Произвольная строка';en='Произвольная строка'");
	ДобавитьВеткуДерева(СтрокиДЗ, "ПроизвольнаяСтрока", ТекстСиноним, "ПроизвольнаяСтрока", "?", Ложь);
	
КонецПроцедуры

// Добавляет новую ветку в дерево значений.
// 
&НаСервере
Функция ДобавитьВеткуДерева(Родитель, Имя, Синоним, Тип, Префикс = "", Использование = Истина)
	
	НоваяСтрока 				= Родитель.Добавить();
	НоваяСтрока.ИмяРеквизита 	= Имя;
	НоваяСтрока.Синоним		 	= Синоним;
	НоваяСтрока.СинонимФикс	 	= Синоним;
	НоваяСтрока.Тип			 	= Тип;
	НоваяСтрока.Префикс			= Префикс;
	НоваяСтрока.Использование	= Использование;
	
	Картинка = 3;
	
	Если Тип = "Реквизиты" Тогда
		Картинка = 0;	
	ИначеЕсли Тип = "ДопРеквизиты" Тогда
		Картинка = 1;
	ИначеЕсли Тип = "ПользовательскиеФункции" ИЛИ Тип = "ПрочиеФункции" Тогда
		Картинка = 2;
	ИначеЕсли Тип = "Реквизит" Тогда
		Картинка = 3;
	ИначеЕсли Тип = "ТабличнаяЧасть" ИЛИ Тип = "ТабличнаяЧастьВрем" Тогда
		Картинка = 4;
	ИначеЕсли Тип = "ПроизвольныеТаблицы" Тогда
		Картинка = 7;	
	ИначеЕсли Тип = "ФиксированноеЗначение" Тогда
		Картинка = 5;	
	ИначеЕсли Тип = "ПараметрПользовательскойФункции" Тогда
		Картинка = 6;
		НоваяСтрока.Синоним = НоваяСтрока.СинонимФикс + " : <" + Строка(НоваяСтрока.Значение) + ">";
	КонецЕсли;
	
	НоваяСтрока.ИндексКартинки = Картинка;
	
	НовСтрокаИД = ИменаСтрокДерева.Добавить();
	
	НовСтрокаИД.ИД 			= НоваяСтрока.ПолучитьИдентификатор();
	НовСтрокаИД.ИмяСтроки 	= Имя;
	
	Возврат НоваяСтрока;
	
КонецФункции

// Заполняет дерево значений в соответствии с данными шаблона, 
// содержащегося в реквизите формы "ШаблонОбъект".
// 
&НаСервере
Процедура ЗаполнитьДеревоПоТекущемуШаблону()
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;	
	КонецЕсли;
	
	ТипОбъекта = Документ.ТипЗначенияОбъекта.Получить();
	
	Проформа = Ложь;
	
	Если (ТипОбъекта = Тип("ДокументСсылка.бит_Проформы")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.бит_ПроизвольнаяФорма")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.бит_ФормаСбораДанных"))
		И ЗначениеЗаполнено(ВидПроформы) Тогда
		Проформа = Истина;
		ЭлементКоллекции = бит_РаботаСПроизвольнымиФормами.ЭмулироватьМетаданные(ВидПроформы, "Массив");
	Иначе	
		// Определим элемент коллекции метаданных, соответствующий выбранному документу.
		ЭлементКоллекции = Документы[Документ.ИмяОбъекта].ПустаяСсылка().Метаданные();
	КонецЕсли;

	ОписаниеТипаДата = Новый ОписаниеТипов("Дата");
						 
	// Заполним дату.
	Если РеквизитПрошелПоТипу(ОписаниеТипаДата) Тогда
		НоваяВетка = ДобавитьВеткуДерева(ПолучитьВеткуДерева("Реквизиты").ПолучитьЭлементы(), "Дата", "Дата", "Реквизит",, Истина);
		ПоместитьОписаниеТипаВХранилище(НоваяВетка.ПолучитьИдентификатор(), ОписаниеТипаДата);
	КонецЕсли;
	
	// Заполним реквизиты.
	Для Каждого Реквизит Из ЭлементКоллекции.Реквизиты Цикл
		ДобавитьРеквизит(ПолучитьВеткуДерева("Реквизиты"), Реквизит, 4);
	КонецЦикла;
	
	Если Проформа Тогда
		
		Для Каждого Реквизит Из ЭлементКоллекции.СтандартныеРеквизиты Цикл
			ДобавитьРеквизит(ПолучитьВеткуДерева("Реквизиты"), Реквизит, 4);
		КонецЦикла
		
	КонецЕсли;
	
	// Заполним табличные части и их реквизиты.
	Если СокрЛП(ТабличнаяЧасть) <> "" Тогда
		
		// Определим, табличная часть ли это.
		ЭтоТабЧасть = Найти(ТабличнаяЧасть, "$") = 0 И Найти(ТабличнаяЧасть, "()") = 0;
		
		Если ЭтоТабЧасть Тогда
			
			Для Каждого ТабЧасть_ Из ЭлементКоллекции.ТабличныеЧасти Цикл
				
				Если Проформа Тогда
					ТабЧасть = ТабЧасть_.Значение;
				Иначе
					ТабЧасть = ТабЧасть_;
				КонецЕсли;
				
				Если НЕ ТабЧасть.Имя = ТабличнаяЧасть Тогда
					Продолжить;
				КонецЕсли;
				
				ВеткаТабЧасть = ДобавитьВеткуДерева(ПолучитьВеткуДерева("Реквизиты").ПолучитьЭлементы(), ТабЧасть.Имя, ТабЧасть.Синоним, "ТабличнаяЧасть", "#Т", Ложь);
				
				Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
					ДобавитьРеквизит(ВеткаТабЧасть, Реквизит, 4);
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			// Это описание произвольной таблицы.
			// Найдем таблицу по имени.
			
			Если ТипЗнч(ОписаниеТаблиц) = Тип("Структура") Тогда
				
				МассивТЧ = ОписаниеТаблиц.МассивОписанияТаблиц;
				
				Для Каждого Таблица Из МассивТЧ Цикл
					
					ИмяТаблицы = Таблица.Имя;
					
					Если ИмяТаблицы <> ТабличнаяЧасть Тогда
						Продолжить;
					КонецЕсли;
					
					ВеткаТабЧасть = ДобавитьВеткуДерева(ПолучитьВеткуДерева("ПроизвольныеТаблицы").ПолучитьЭлементы(), ИмяТаблицы, ИмяТаблицы, "ТабличнаяЧастьВрем", "#Т", Ложь);
					
					Для Каждого Реквизит Из Таблица.Реквизиты Цикл
						ДобавитьРеквизит(ВеткаТабЧасть, Реквизит, 4);
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполним дополнительные реквизиты.
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		ВеткаТабЧасть = ДобавитьВеткуДерева(ПолучитьВеткуДерева("ДопРеквизиты").ПолучитьЭлементы(), 
							ИмяРеквизита.Значение, ИмяРеквизита.Значение + "()", "ДопРеквизит", "", Истина);
	КонецЦикла;
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	бит_ВидыДополнительныхАналитик.Ссылка КАК Аналитика
	|ИЗ
	|	ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик КАК бит_ВидыДополнительныхАналитик");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ РеквизитПрошелПоТипу(Выборка.Аналитика.ТипЗначения) Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.Аналитика.Предопределенный Тогда
			ИмяРеквизита = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПолучитьИмяПредопределенного(Выборка.Аналитика);
		Иначе
			ИмяРеквизита = "Ид_" + СокрЛП(Выборка.Аналитика.Код);
		КонецЕсли;
		
		ВеткаТабЧасть = ДобавитьВеткуДерева(ПолучитьВеткуДерева("ДопАналитика").ПолучитьЭлементы(),
		ИмяРеквизита,
		СокрЛП(Выборка.Аналитика),
		"ДопАналитика",
		"",
		Истина);
	КонецЦикла;
	
	Если НЕ НеПоказыватьПользовательскиеФункции Тогда
	
		// Заполним пользовательские функции.
		ВыборкаФункций = Справочники.бит_ПользовательскиеФункции.Выбрать();
		
		Пока ВыборкаФункций.Следующий() Цикл
			ДобавитьПользовательскуюФункцию(ПолучитьВеткуДерева("Функции").ПолучитьЭлементы(), ВыборкаФункций.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДобавитьВеткуПрочиеФункции(Регистр.ИмяРегистра) Тогда
		
		ВеткаПрочиеФункции = ПолучитьВеткуДерева("ПрочиеФункции").ПолучитьЭлементы();
		ДобавитьФункцииМодуля(ВеткаПрочиеФункции);
		
	КонецЕсли; 
		
КонецПроцедуры

// Процедура заполняет ветку "ПрочиеФункции" функциями, которые доступны в общем модуле бит_мхо_ОбщегоНазначенияСервер. 
//
&НаСервере
Процедура ДобавитьФункцииМодуля(ВеткаПрочиеФункции)

	Операции = Новый Массив;	
	
	ПараметрыОперации = Новый Структура("Сумма, Период, СтруктураШапкиДокумента", "Число", "Дата", Неопределено);
	ОписаниеФункции	  = Новый Структура("Имя, Параметры", "ПересчитатьРеглУпр", ПараметрыОперации);
	Операции.Добавить(ОписаниеФункции);
	
	ПараметрыОперации = Новый Структура("Сумма, Период, СтруктураШапкиДокумента","Число","Дата",Неопределено);
	ОписаниеФункции   = Новый Структура("Имя, Параметры","ПересчитатьРеглМУ", ПараметрыОперации);
	Операции.Добавить(ОписаниеФункции);
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("Сумма",					"Число");
	ПараметрыОперации.Вставить("Период",					"Дата");
	ПараметрыОперации.Вставить("Сценарий",				"СправочникСсылка.СценарииПланирования");
	ПараметрыОперации.Вставить("СтруктураШапкиДокумента",Неопределено);
	
	ОписаниеФункции = Новый Структура("Имя, Параметры","ПересчитатьРеглСценарий", ПараметрыОперации);
	Операции.Добавить(ОписаниеФункции);
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("Сумма",		"Число");
	ПараметрыОперации.Вставить("Период",		"Дата");
	ПараметрыОперации.Вставить("ВалютаНач",	"СправочникСсылка.Валюты");
	ПараметрыОперации.Вставить("ВалютаКон",	"СправочникСсылка.Валюты");

	ОписаниеФункции = Новый Структура("Имя, Параметры", "ПересчитатьПоВалюте", ПараметрыОперации);
	Операции.Добавить(ОписаниеФункции);

	Для каждого ТекОписание Из Операции Цикл
		
		СтрокиФункции = ДобавитьВеткуДерева(ВеткаПрочиеФункции, ТекОписание.Имя, ТекОписание.Имя+"()", "ПользовательскаяФункция", "", Истина).ПолучитьЭлементы();
		
		Для каждого КиЗ Из ТекОписание.Параметры Цикл
		
			   ИмяПараметра = КиЗ.Ключ;
			   ТипСтр = КиЗ.Значение;
			   
			   Если ЗначениеЗаполнено(ТипСтр) Тогда
				   
				   Строка = ДобавитьВеткуДерева(СтрокиФункции, ИмяПараметра, ИмяПараметра, "ПараметрПользовательскойФункции", "", Ложь);
				   ПоместитьОписаниеТипаВХранилище(Строка.ПолучитьИдентификатор(), Новый ОписаниеТипов(ТипСтр));
				   
			   Иначе	
				   
				   // Не редактируемый параметр, в функцию жестко подставляется имя.
				   Строка = ДобавитьВеткуДерева(СтрокиФункции, ИмяПараметра, ИмяПараметра, "", "", Ложь);
				   Строка.Значение = ИмяПараметра;
				   
			   КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЦикла; 

КонецПроцедуры // ДобавитьФункцииМодуля()

// Рекурсивно добавляет в дерево значений описание всех реквизитов, подчиненных
// "РеквизитМетаданные" с глубиной иерархии "НеобходимыйУровень".
//
&НаСервере
Функция ДобавитьРеквизит(ВеткаДерева, РеквизитМетаданные, НеобходимыйУровень)
	
	МетаданныеСсылки = бит_МеханизмХозяйственныхОперацийСервер.ПолучитьМетаданныеСсылкиПоТипу(РеквизитМетаданные.Тип);
	
	Если МетаданныеСсылки = Неопределено ИЛИ НеобходимыйУровень = 0 Тогда
		Если РеквизитПрошелПоТипу(РеквизитМетаданные.Тип) Тогда 
			ВеткаДереваНов = ДобавитьВеткуДерева(ВеткаДерева.ПолучитьЭлементы(), РеквизитМетаданные.Имя, РеквизитМетаданные.Синоним, "Реквизит");
			ПоместитьОписаниеТипаВХранилище(ВеткаДереваНов.ПолучитьИдентификатор(), РеквизитМетаданные.Тип);
			Возврат ВеткаДереваНов;
		КонецЕсли;
	Иначе
		
		ВеткаДереваНов = ДобавитьВеткуДерева(ВеткаДерева.ПолучитьЭлементы(), РеквизитМетаданные.Имя, РеквизитМетаданные.Синоним, "Реквизит");
		ПоместитьОписаниеТипаВХранилище(ВеткаДереваНов.ПолучитьИдентификатор(), РеквизитМетаданные.Тип);
				
		Для Каждого Реквизит Из МетаданныеСсылки.Реквизиты Цикл
			ДобавитьРеквизит(ВеткаДереваНов, Реквизит, НеобходимыйУровень - 1)
		КонецЦикла;
		
		Если НЕ РеквизитПрошелПоТипу(РеквизитМетаданные.Тип) Тогда
			Если ВеткаДереваНов.Строки.Количество() = 0 Тогда
				УдалитьВеткуДерева(ВеткаДереваНов);
			Иначе
				ВеткаДереваНов.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Удаляет из дерева значений ветку "Ветка".
//
&НаСервере
Процедура УдалитьВеткуДерева(Ветка)
	
	Родитель = Ветка.ПолучитьРодителя();
	Родитель.ПолучитьЭлементы().Удалить(Ветка.ПолучитьИдентификатор);
	
КонецПроцедуры

// Добавляет в дерево значений для выбора пользовательскую функцию
// с описанием параметров ее вызова.
//
&НаСервере
Процедура ДобавитьПользовательскуюФункцию(СтрокиДерева, ФункцияСсылка)
	
	// Добавим строку для самой функции.
	СтрокиФункции = ДобавитьВеткуДерева(СтрокиДерева, ФункцияСсылка.Наименование, ФункцияСсылка.Наименование + "()", "ПользовательскаяФункция", "", Истина).ПолучитьЭлементы();
	
	// Добавим строки для параметров функции.
	Для Каждого Параметр Из ФункцияСсылка.ПараметрыФункции Цикл
		Строка = ДобавитьВеткуДерева(СтрокиФункции, Параметр.Наименование, Параметр.Наименование, "ПараметрПользовательскойФункции", "", Ложь);
		ПоместитьОписаниеТипаВХранилище(Строка.ПолучитьИдентификатор(), Параметр.ТипПараметра.Получить());
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает текущую строку в соответствии со значением реквизита формы "ТекущееЗначений".
// 
&НаКлиенте
Процедура ПозиционироватьВыделение()
	
	Если ТипЗнч(ТекущееЗначение) = Тип("Строка") Тогда
		
		// Проверим, может быть это режим построителя.
		Если СтрЧислоВхождений(ТекущееЗначение, "#") > 1 
			ИЛИ Найти(ТекущееЗначение, "+")
			ИЛИ Найти(ТекущееЗначение, "-")
			ИЛИ Найти(ТекущееЗначение, "*")
			ИЛИ Найти(ТекущееЗначение, "/") Тогда
			
			// Это произвольное выражение.
			РежимПостроителяПроизвольногоВыражения = Истина;
			
			Элементы.ДеревоЗначений.ТекущаяСтрока = 0;
			
		КонецЕсли;
		
		Если Найти(ТекущееЗначение, "#") > 0 Тогда // Это тег
			
			// Начнем обход по именам строк с начала тега
			// 1. Получим массив имен строк.
			МассивИмен = ИменаСтрок(ТекущееЗначение);
			
			ПозиционироватьВыделениеПоМассивуИмен(МассивИмен);
			
			Если МассивИмен[0] = "ПользовательскиеФункции" Тогда
				// Заполнить значения параметров.
				ЗаполнитьПараметрыСтрокиФункции(ДеревоЗначений.НайтиПоИдентификатору(Элементы.ДеревоЗначений.ТекущаяСтрока), ТекущееЗначение);
			КонецЕсли;
			
		Иначе // Фиксированное значение типа "Строка".
			ПолеФиксированноеЗначение = ТекущееЗначение;
			Элементы.ДеревоЗначений.ТекущаяСтрока = ПолучитьВеткуДереваНаКлиенте("ФиксированноеЗначение").ПолучитьИдентификатор();
		КонецЕсли;
		
	Иначе // Это фиксированное значение.
		ПолеФиксированноеЗначение = ТекущееЗначение;
		Элементы.ДеревоЗначений.ТекущаяСтрока = ПолучитьВеткуДереваНаКлиенте("ФиксированноеЗначение").ПолучитьИдентификатор();
	КонецЕсли;
	
	Если РежимПостроителяПроизвольногоВыражения Тогда
		НадписьСтрокаЗначения = ТекущееЗначение;
	КонецЕсли;
	
КонецПроцедуры

// Находит строку в дереве значений, согласно старшинству в "МассивИмен"
// и устанавливает ее текущей.
// 
&НаКлиенте
Процедура ПозиционироватьВыделениеПоМассивуИмен(МассивИмен)
	
	ТекущийРодитель = ДеревоЗначений;
	
	Для Каждого Элемент Из МассивИмен Цикл
		
		ДляПоиска = Элемент;		
		Если ДляПоиска = "ПользовательскиеФункции" Тогда
			ДляПоиска = "Функции";
		КонецЕсли;
		
		ТекущийРодитель = ПолучитьВеткуДереваНаКлиенте(ДляПоиска);		
		Если ТекущийРодитель = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ДеревоЗначений.ТекущаяСтрока = ТекущийРодитель.ПолучитьИдентификатор();
	
КонецПроцедуры

// Выделяет из строки описания параметры вызова функции и заполняет их.
// 
&НаКлиенте
Процедура ЗаполнитьПараметрыСтрокиФункции(СтрокаФункции, СтрокаИмя)
	
	// Получим массив параметров.
	Массив = Новый Массив;
	// Выделим подстроку между скобок
	СкобкаОткр = Найти(СтрокаИмя, "(");
	СкобкаЗакр = Найти(СтрокаИмя, ")");
	ПодстрокаПоиска = Сред(СтрокаИмя, СкобкаОткр + 1, СкобкаЗакр - СкобкаОткр - 1);
	
	Пока СтрДлина(ПодстрокаПоиска) <> 0 Цикл
		// Получим текст до запятой.
		ПозТочки = Найти(ПодстрокаПоиска, ", ");
		
		Если ПозТочки = 0 Тогда // Это последнее имя.
			Массив.Добавить(СокрЛП(ПодстрокаПоиска));
			ПодстрокаПоиска = "";
		Иначе
			ОчередноеИмя = Лев(ПодстрокаПоиска, ПозТочки - 1);
			Массив.Добавить(СокрЛП(ОчередноеИмя));
			// Сократим строку имен.
			ПодстрокаПоиска = Прав(ПодстрокаПоиска, СтрДлина(ПодстрокаПоиска) - ПозТочки);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним значения параметров.
	жи = -1;
	
	СтрокиФункции = СтрокаФункции.ПолучитьЭлементы();
	
	Для Каждого Строка Из СтрокиФункции Цикл
		жи = жи + 1;
		Строка.Значение = Массив[жи];
		Строка.Синоним = Строка.СинонимФикс + " : <" + Строка(Строка.Значение) + ">";
	КонецЦикла;
	
КонецПроцедуры

// Функция добавляет ветку прочие функции.
//
// Возвращаемое значение:
//  флДобавить - Булево.
//
&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВеткуПрочиеФункции(ИмяРегистра)

    Имена = Новый Соответствие;
	Имена.Вставить("бит_ОборотыПоБюджетам", Истина);
	Для Н = 1 По 5 Цикл		
		Имена.Вставить("бит_Дополнительный_"+Н, Истина);		
	КонецЦикла; 

	флДобавить = Имена[ИмяРегистра] = Истина;
	
	Возврат флДобавить;
	
КонецФункции

#КонецОбласти

#КонецОбласти
